//---------------------------------------------------------------------------------
// »м€: three.js                                                  
// язык: JScript                                                   
// ќписание: задание 3             
//---------------------------------------------------------------------------------

var n = 140

function F(i)
{
	if(i == 1) return 1;
	else return Math.log(F(i-1)*i)+9
}

var sum = 0;
for(var j = 1; j <= n; j++) sum += F(j);
WScript.Echo(sum);
